Repository: loginom/site-articles-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Производные компоненты: исправлена ошибка «Перемещённый производный компонент недоступен для узла» при сворачивании в Подмодель (#8931).
en: Derived components: The following error was corrected: "Transferred derived component is not available for the node" when collapsing to the Supernode (#8931).

source: Производные компоненты: исправлена ошибка при загрузке пакета, содержащего Подмодель с узлом, созданным по неисправному компоненту.
en: Derived components: The error occurred while loading the package that contained the Supernode with the node created on the basis of the faulty component was corrected.

source: Производные компоненты: исправлена ошибка, ранее возникавшая при клонировании Подмодели, содержащей базовую и производную Подмодель с настроенными визуализаторами (#9116).
en: Derived components: The error that previously occurred while cloning the Supernode that contained the base and derived Supernode with the configured visualizers was corrected (#9116).

source: Производные компоненты: реализован вывод, кроме названия узла, ещё и GUID с именем пакета в случаях, когда его не удалось найти в исходных или открытых пакетах.
en: Derived components: Apart from the node name, GUID with the package name is also displayed in the cases when it is not possible to find it in the source or opened packages.

source: Производные компоненты: сообщение при попытке удалить производный компонент сделано более информативным.
en: Derived components: The message shown while attempting to delete the derived component became more informative.

source: Производные компоненты: учтена ситуация, когда в текущем пакете есть ссылка на пакет с производными компонентами, но в программе ещё не созданы узлы, соответствующие этим производным компонентам.
en: Derived components: The situation when there was a reference to the package with derived components in the current package but the nodes matching these derived components had not been created in the program yet was taken into account.

source: Профили кластеров: иконка фильтрации и текст кнопки теперь меняют цвет, если фильтр активен (#8174, #8463).
en: Cluster profiles: filtration icon and button text now change their colors if the filter is active (#8174, #8463).

source: Разворачивание Подмодели: если подмодель содержала большое количество узлов, а также была расположена близко к левому или верхнему краю рабочего пространства Сценария, то при её разворачивании часть узлов могла оказаться за пределами рабочего пространства Сценария (#6949).
en: Expand Supernode: if the supernode contained many nodes and it was located close to the left or upper edge of the Workflow working space, when it was collapsed, some nodes could be outside the Workflow working space (#6949).

source: Редактор ввода дата/время: доработан редактор ввода данных типа Дата/Время.
en: Date/time entry editor: Date/Time data entry editor was improved.

source: Ссылки на пакеты: при пересохранении пакета возникало повреждение ссылки, в результате чего используемые из подключаемого файла узлы не находились.
en: References to packages: The reference was damaged when the package was resaved. That's why it was not possible to find the nodes used from the connected file.

source: Страница «Подключения»: Исправлена ошибка "Cannot read property 'getStore' of undefined", которая возникала, если закрыть Страницу «Подключения» во время тестирования длительно активирующегося подключения (#8763).
en: "Connections" page: "Cannot read property 'getStore' of undefined" error was corrected. It occurred if "Connections" page was closed while testing the connection being activated for a long time (#8763).

source: Таблица в переменные: при открытии быстрого просмотра узла «Таблица в переменные» не выделялась первая ячейка, что иногда могло приводить к ошибке.
en: Table to variables: When quick view of "Table to variables" node was opened, the first cell was not selected that could sometimes cause an error.

source: Условие: Если на странице мастера настройки «Настройка списка портов» задать 2 порта, а затем второй порт переместить вверх, то нарушается нумерация портов (строк в таблице содержащей список портов) — оба порта имели номер 2.
en: Condition: If 2 ports were set on the page of "Configure list of ports" wizard, and then the second port was moved up, the numbering of ports (rows in the table containing the list of ports) was broken. Both ports were numbered 2.

source: Установка Loginom: при установке одной из серверных редакций Loginom поверх ранее установленной другой редакции не заменялся исполняемый файл Server.exe, в результате чего после обновления запускалась предыдущая редакция Loginom (#8132).
en: Loginom setup: when setting one of the server Loginom editions over another previously installed edition, the executable Server.exe file was not replaced, therefore, the previous Loginom edition was started after update (#8132).

source: Файловое хранилище: в корне файлового хранилища сделаны неактивными действия, которые невозможно было выполнить: Загрузить, Создать каталог, Скачать, Переименовать, Копировать, Вставить, Вырезать, Удалить (#8542).
en: File storage: the actions that could not be performed became inactive in the file storage root: Load, New Folder, Download, Rename, Copy, Paste, Cut, Delete (#8542).

source: Файловое хранилище: если загрузить, а затем удалить файл, то невозможно было повторно загрузить с таким же именем до завершения сессии приложения.
en: File storage: if the file was uploaded and then deleted, it was impossible to upload it again with the same name before the application session termination.

source: Файловое хранилище: если из каталога на уровень вверх или уровень вниз перемещался внутренний каталог, то при попытке открыть первый каталог возникала ошибка «System Error.
en: File storage: if the internal directory was moved one level up or down from the directory, while attempting to open the first directory, the following error occurred: "System Error.

source: Файловое хранилище: если после копирования каталога переименовать один из каталогов, содержащих копируемый каталог, то при вставке возникала ошибка «System Error.
en: File storage: if one of the directories containing the copied directory was renamed after directory copying, when pasting, the following error occurred: "System Error.

source: Файловое хранилище: если удалялась папка и внутри папки находилась символическая ссылка на папку, то удалялась только ссылка.
en: File storage: If the folder was deleted, and there was a symbolic reference to the folder inside the folder, the reference was also deleted.

source: Файловое хранилище: если перейти в папку файлового хранилища, ранее открытую в другой вкладке, а затем попытаться закрыть вкладку с ранее открытой папкой нажатием на X (крестик), то возникала ошибка "Cannot read property 'ActiveLoadersCount' of undefined" или "this.FFileSenderManager is undefined" (#8529).
en: File storage: if it was required to go to the file storage folder that had been previously opened in another tab, and then try to close the tab with the previously opened folder by pressing X (cross button icon), the following error occurred: "Cannot read property 'ActiveLoadersCount' of undefined" or "this.FFileSenderManager is undefined" (#8529).

source: Файловое хранилище: из дерева каталогов не удалялась удаленная через «Вырезать–Вставить» папка.
en: File storage: the folder deleted by means of "Cut-Paste" functionality was not deleted from the directory tree.

source: Файловое хранилище: оптимизирована скорость создания каталогов для случая, когда в текущем каталоге уже содержится большое количество каталогов (несколько десятков или сотни вложенных каталогов) (#8196).
en: File storage: the speed of directories creation is optimised for the case when there are many directories in the current directory (several dozens or hundreds of nested directories) (#8196).

source: Файловое хранилище: при выполнении функционала «Вырезать-Вставить» вместо копирования и удаления исходной папки теперь используется операция перемещения.
en: File storage: when executing "Copy-Paste" functionality, move operation is now used instead of the source folder copying and pasting.

source: Файловое хранилище: при переходе из текущего каталога в родительский, выделение устанавливалось на "..", а не на каталог, из которого вышли.
en: File storage: when moving from the current directory to the parent one, ".." was selected but not the quitted directory.

source: Файловое хранилище: при попытке открыть пакет через символическую ссылку на файл, физически расположенный в сетевой папке, из-за невозможности определить дату модификации файла, возникала ошибка «Системе не удается найти указанный путь» (#8452).
en: File storage: while attempting to open the package using the symbolic link to the file physically located in the network folder, the following error occurred: "System failed to find the specified path". It was connected with failure to define the file modification date (#8452).

source: Фильтр строк: В мастере настройки узла предпросмотр не изменял данные, при изменении переменной, используемой в условии фильтра (#9423).
en: Row filter: The preview did not change data in the node wizard when changing the variable used in the filter condition (#9423).

source: Фильтр строк: было невозможно настроить два и более условий по временному промежутку (первый/не первый или последний/не последний) (#8634).
en: Row filter: it was impossible to set two and more conditions by the time lapse (first/not first or last/not last) (#8634).

source: Фильтр строк: если было выбрано условие фильтрации «В списке / Вне списка», а при нажатии «Получить список» возникала ошибка (например, если не было подключено поле), то после возникновения ошибки было невозможно редактировать поле ввода (#8716).
en: Row filter: if "Listed / Not listed" filtration criterion was selected and an error occurred when pressing on "Get list" (for example, if no field was connected), it was impossible to edit the entry field upon occurrence of the error (#8716).

source: Фильтр строк: если для полей целого, вещественного типов или типа дата/время выбрать условие «В списке / Вне списка», а в поле ввода «Список» ввести текст, то возникала ошибка "Cannot read property 'text' of undefined" (#8444).
en: Row filter: if "Listed / Not listed" criterion was selected for the fields related to the integer, real types or date/time type and text was inserted into the "List" entry field, the following error occurred: "Cannot read property 'text' of undefined" (#8444).

source: Фильтр строк: если для фильтрации было выбрано условие «В списке / Вне списка» и использовались значения вещественного типа, происходило ошибочное округление фильтруемых значений до второго знака после запятой.
en: Row filter: if "Listed / Not listed" criterion was selected for filtration and the real type values were used, erroneous rounding to two decimal places of filtered values occurred.

source: Фильтр строк: если для фильтрации было выбрано условие «В списке / Вне списка» и использовались значения типа Дата/Время, происходило ошибочное округление и отбрасывались значения секунд.
en: Row filter: if "Listed / Not listed" criterion was selected for filtration and the values related to Date/Time type were used, erroneous rounding occurred and second values were ignored.

source: Фильтр: при настройке фильтра по временному промежутку, запрещено вводить значение количества периодов меньше 1.
en: Filter: When the filter is set by the time span, it is forbidden to set the period number value less than 1.

source: Цикл: Исправлена ошибка Access violation, которая возникала, если на этапе синхронизации перед выполнением в базовом узле происходила ошибка (#9479).
en: Цикл: Access violation error was corrected. It was observed if an error occurred at the synchronization stage before execution in the base node (#9479).

source: Цикл: при запуске в параллельном режиме в результате создания большого количества производных узлов могла возникать ошибка «Значение индекса … параметра “…” вне диапазона […; …]» (#8200).
en: Loop: when starting in the parallel mode, due to creation of many derived nodes the following error could occur: "Index value … of “…” parameter is out of […; …] range" (#8200).

source: Цикл: использовалось неправильное значение переменной Цикла на 1-й итерации Цикла, настроенного на импорт из базы данных.
en: Loop: Incorrect value of the Loop variable for the 1st Loop iteration configured for import from database was used.

source: Экспорт в Kafka: Узел зависал при попытке отправить более 100 000 сообщений.
en: Export to Kafka: The node was frozen while attempting to send more than 100,000 messages.

source: Экспорт в LGD-файл: Исправлена ошибка "Access violation", которая возникала, при активации узла, во входном порту которого удалены все поля, кроме поля переменного типа (или поле переменного типа перемещено на другую позицию в списке).
en: Export to LGD file: "Access violation" error was corrected. It occurred when activating the node in the input port of which all fields were deleted with the exception of the field related to the variable type (or the field related to the variable type was moved to another position in the list).

source: Экспорт в LGD-файл: Когда Экспорт происходил из Импорта LGD, TXT, Excel или из Цикла, при перестановке местами полей, содержащих null-значения, поля экспортировались неправильно: вместо null-значений появлялся false, 0, 0.00, 00:00 или пустые строки, в зависимости от типа; вместо ненулевых значений — null-значения.
en: Export to LGD file: When Export was performed from LGD, TXT, Excel import or from Loop, when rearranging the fields that contained null values, the fields were exported incorrectly: false, 0, 0.00, 00:00 or empty rows appeared instead of null values according to the type; null values appeared instead of non-zero values.

source: Экспорт в PostgreSQL: при попытке экспорта строк в поля xml или json возникала ошибка «колонка "..." имеет тип ..., а выражение - character varying».
en: Export to PostgreSQL: while attempting to export strings to xml or json fields, the following error occurred: "column "..." has type ..., and expression - character varying".

source: Экспорт в базу данных MySQL: если в Таблицу с CHARACTER SET utf8 в поле типа TEXT экспортировалась одна строка, состоящая из трехбайтных Unicode символов (например, иероглифов китайского языка), то это значение могло экспортироваться с ошибкой (#8229).
en: Export to MySQL database: if one string that consisted of 3-byte Unicode characters (for example, the Chinese characters) was exported to the Table with CHARACTER SET utf8 in the TEXT field, this value could be exported with an error (#8229).

source: Экспорт в базу данных MySQL: при экспорте в таблицу 1, 1001, 2001, .. строк с CHARACTER SET utf8 последняя экспортированная строка содержала ошибочное значение (#8230).
en: Export to MySQL database: when exporting 1, 1001, 2001, .. strings with CHARACTER SET utf8 to table, the last exported string contained the invalid value (#8230).

source: Экспорт в базу данных: Исправлена ошибка "Invalid precision value", которая возникала при экспорте в MS Access текстовых столбцов полностью состоящих из пустых или null значений (#9501).
en: Export to database: "Invalid precision value" error was corrected. It occurred during export of text columns that consisted entirely of empty or null values to MS Access (#9501).

source: Экспорт в базу данных:В мастере настройки экспорта в БД для исходных столбцов отсутствовало контекстное меню.
en: Export to Database: There was no context menu for the source columns in Export to Database wizard.

source: Экспорт в текстовый файл: При экспорте строк с не-ASCII-символами в файл с фиксированной шириной столбцов, ширина столбцов в полученном файле не была одинаковой.
en: Export to text file: When exporting the strings with non ASCII characters to the file with the fixed column width, the column width in the received file was not the same.

source: Элементы пользовательского интерфейса: при скроле (прокрутке) таблиц, содержащих список полей, а также в визуализаторе Статистика, если отображалось большое количество значений, то могло наблюдаться «дергание» или «сопротивление прокрутке» (#6288, #6700).
en: Elements of user interface: if many values were displayed when scrolling the tables containing the list of fields and in the Statistics visualizer, "stumbling" or "resistance to scrolling" was observed (#6288, #6700).

source: Ядро платформы: в случае, если Подмодель содержала Узел-ссылку, ссылающийся на другой узел внутри этой подмодели, а порядок выполнения для Узла-ссылки был связан со входным и выходным портом содержащей его Подмодели, то процесс активации Подмодели мог зависнуть и его невозможно было отменить.
en: Platform core: if the Supernode contained the Reference Node referring to another node inside this supernode, and the execution order of the Reference Node was connected with the input and output port of the Supernode that contained it, the Supernode activation process could be frozen, and it was impossible to cancel it.

source: Ядро платформы: если пользователь с ролью «Проектирование сценариев» пытался открыть пакет, находящийся в папке, у которой на уровне файловой системы был предоставлен доступ только на чтение, то пакет не открывался, а пользователь получал сообщение, что пакет не удалось открыть.
en: Platform core: if the user with "Workflows design" role tried to open the package in the read-only folder of the file system level, it was not possible to open the package, and the user received the message informing about package opening failure.

source: Ядро платформы: количество рабочих потоков сделано динамическим.
en: Platform core: worker thread count became dynamic.

source: Ядро платформы: оптимизирована скорость сохранения больших пакетов — изменен способ проверки наличия несохранённых изменений в пакете (#8345).
en: Platform core: the speed of large packages saving was optimised. The method used to check occurrence of unsaved changes in the package was changed (#8345).

source: Чтобы в новом Интеграторе использовались те же адреса, что и в старом, нужно указать urlPathPrefix="Service.svc".
en: To use the same addresses in the new Integrator as in the old one, it is required to specify as follows: urlPathPrefix="Service.svc".

source: JavaScript, Калькулятор (JavaScript): веб-приложение зависало, если в мастере настройки JavaScript использовались JSDoc-комментарии и начали вводить имя функции, содержащей такой комментарий, или же вызывался мастер подстановки (Ctrl + Пробел); проблема могла также возникнуть после написания строки импорта модуля, если в импортируемом модуле содержались JSDoc-комментарии (#7833).
en: JavaScript, Calculator (JavaScript): the web application could be frozen if the JSDoc comments were used in the JavaScript wizard, and the name of the function that contained such comment was entered, or the lookup wizard was called (Ctrl + Space). Such problem could also arise when writing the module import row if the imported module contained the JSDoc comments (#7833).

source: JavaScript: если в редакторе кода при выполнении предпросмотра результирующая таблица содержала большое количество (несколько тысяч) строк, то могла возникать ошибка "Runtime is disabled" (#8048).
en: JavaScript: if the resulting table contained too large (several thousands) row count in the code editor when previewing, the following error could occur: "Runtime is disabled" (#8048).

source: Группировка, Таблица в переменные: если при выполнении сценария возникала нехватка оперативной памяти, то могли возникать неинформативные ошибки «Ошибка активации узла...» (#8052).
en: Grouping, Table into Variables: if there was a lack of memory during the workflow execution, the following uninformative errors could occur: "Error while node activation..." (#8052).

source: Замена: при подключении нескольких таблиц замены использовались данные только из первой таблицы (#7872).
en: Replace: when connecting several replacement tables, the data only from the first table was used (#7872).

source: Импорт из Excel: при повторном открытии мастера настройки не обновлялись данные в окне предпросмотра, даже если исходный файл был изменен (#6088).
en: Import from Excel: in the case of the repeated wizard opening, the data was not updated in the preview window even if the source file had been changed (#6088).

source: Импорт из Базы данных: если в мастере настройки импорта в окне предпросмотра выделялась строка, находящаяся ниже первой страницы данных, то при повторном открытии окно предпросмотра могло быть пустым и для отображения данных требовалось прокрутить окно просмотра вверх или открыть предпросмотр повторно (#8044).
en: Import from Database: if the row that was lower than the first data page was selected in the import wizard in the preview window, in the case of the repeated opening, the preview window could be empty, and to display the data, it was required to scroll up the view window or to open the preview once again (#8044).

source: Калькулятор: если первым аргументом в функцию DateTimeToStr передавался Null, то в функции возникала ошибка и вычисление выражения, в котором использовалась функция, останавливалось, а в лог записывалось сообщение об ошибке; теперь в такой ситуации функция DateTimeToStr возвращает Null (#7969).
en: Calculator: if Null was the first argument to be moved to DateTimeToStr function, the error occurred in the function, and calculation of the expression in which the function was used was stopped, and error message was written in the log. Now, in such case, DateTimeToStr function returns Null (#7969).

source: Квантование: если количество интервалов квантования задавалось при помощи управляющей переменной и перед сопоставленным с переменной столбцом имелся неиспользуемый столбец, то при сохранении и повторном открытии пакета сопоставление переменной сбрасывалось (#5163, #6281).
en: Binning: if the binning bin count was set by means of the control variable, and there was an unused column before the column mapped with the variable, the variable mapping was reset when saving and repeated opening of the package (#5163, #6281).

source: Конечные классы: если объединить начальные классы в мастере настройки c помощью перетаскивания границы класса, то возникала ошибка "Cannot read property 'element' of undefined" (#7504).
en: Coarse сlasses: the following error occurred when joining the fine classes in the wizard by dragging the class bound: "Cannot read property 'element' of undefined" (#7504).

source: Конечные классы: оптимизировано потребление оперативной памяти при использовании визуализатора «Конечные классы» (#7924).
en: Coarse сlasses: memory consumption when using the "Coarse classes" visualizer was optimized (#7924).

source: Логистическая регрессия: в браузере Internet Explorer при выборе метода валидации возникала ошибка «Не удалось получить свойство "setWidth" ссылки, значение которой не определено или является NULL» (#7659).
en: Logistic regression: the following error occurred in the Internet Explorer browser when selecting the validation method: "Failed to get "setWidth" property of the reference the value of which is not defined or is NULL" (#7659).

source: Подключения: если значение URL сервиса задавалось через переменную, то при первичной настройке на шаге тестирования или верификации подключения возникала ошибка «Не указан URL сервиса» (#7982).
en: Connections: if the URL service value was set by means of a variable, the following error occurred during the initial setting at the stage of connection testing or verification: "Service URL not specified" (#7982).
